_posts/2016-02-17-org模式中的代码块支持的语言及表格的转换.html
---
date: 2016-02-17
tags: 
- emacs
author: tiankai
layout: post
title: org模式中的代码块支持的语言及表格的转换
excerpt: emacs org sourcecode 
categories: 
- emacs
---

<div id="outline-container-org9f3f909" class="outline-2">
<h2 id="org9f3f909">org模式中的代码块中支持的语言</h2>
<div class="outline-text-2" id="text-org9f3f909">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Language</th>
<th scope="col" class="org-left">Identifier</th>
<th scope="col" class="org-left">Language</th>
<th scope="col" class="org-left">Identifier</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Asymptote</td>
<td class="org-left">asymptote</td>
<td class="org-left">Awk</td>
<td class="org-left">awk</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">C++</td>
<td class="org-left">C++</td>
</tr>

<tr>
<td class="org-left">Clojure</td>
<td class="org-left">clojure</td>
<td class="org-left">CSS</td>
<td class="org-left">css</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">d</td>
<td class="org-left">ditaa</td>
<td class="org-left">ditaa</td>
</tr>

<tr>
<td class="org-left">Graphviz</td>
<td class="org-left">dot</td>
<td class="org-left">Emacs Calc</td>
<td class="org-left">calc</td>
</tr>

<tr>
<td class="org-left">Emacs Lisp</td>
<td class="org-left">emacs-lisp</td>
<td class="org-left">Fortran</td>
<td class="org-left">fortran</td>
</tr>

<tr>
<td class="org-left">gnuplot</td>
<td class="org-left">gnuplot</td>
<td class="org-left">Haskell</td>
<td class="org-left">haskell</td>
</tr>

<tr>
<td class="org-left">Java</td>
<td class="org-left">java</td>
<td class="org-left">Javascript</td>
<td class="org-left">js</td>
</tr>

<tr>
<td class="org-left">LaTeX</td>
<td class="org-left">latex</td>
<td class="org-left">Ledger</td>
<td class="org-left">ledger</td>
</tr>

<tr>
<td class="org-left">Lisp</td>
<td class="org-left">lisp</td>
<td class="org-left">Lilypond</td>
<td class="org-left">lilypond</td>
</tr>

<tr>
<td class="org-left">MATLAB</td>
<td class="org-left">matlab</td>
<td class="org-left">Mscgen</td>
<td class="org-left">mscgen</td>
</tr>

<tr>
<td class="org-left">Objective Caml</td>
<td class="org-left">ocaml</td>
<td class="org-left">Octave</td>
<td class="org-left">octave</td>
</tr>

<tr>
<td class="org-left">Org mode</td>
<td class="org-left">org</td>
<td class="org-left">Oz</td>
<td class="org-left">oz</td>
</tr>

<tr>
<td class="org-left">Perl</td>
<td class="org-left">perl</td>
<td class="org-left">Plantuml</td>
<td class="org-left">plantuml</td>
</tr>

<tr>
<td class="org-left">Processing.js</td>
<td class="org-left">processing</td>
<td class="org-left">Python</td>
<td class="org-left">python</td>
</tr>

<tr>
<td class="org-left">R</td>
<td class="org-left">R</td>
<td class="org-left">Ruby</td>
<td class="org-left">ruby</td>
</tr>

<tr>
<td class="org-left">Sass</td>
<td class="org-left">sass</td>
<td class="org-left">Scheme</td>
<td class="org-left">scheme</td>
</tr>

<tr>
<td class="org-left">GNU Screen</td>
<td class="org-left">screen</td>
<td class="org-left">Sed</td>
<td class="org-left">sed</td>
</tr>

<tr>
<td class="org-left">shell</td>
<td class="org-left">sh</td>
<td class="org-left">SQL</td>
<td class="org-left">sql</td>
</tr>

<tr>
<td class="org-left">SQLite</td>
<td class="org-left">sqlite</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgee299c8" class="outline-2">
<h2 id="orgee299c8">org模式中的表格</h2>
<div class="outline-text-2" id="text-orgee299c8">
<p>
在日常生活中,常遇到将一些数据转换为表格的情况,我们最常用的方法就是手动的一项项的书写,
现在有了org模式之后,可以将很方便将一些数据直接转换为表格.如下所示的数据:
</p>
<pre class="example">
Language	Identifier	Language	Identifier 
Asymptote	asymptote	Awk	awk 
C	C	C++	C++ 
Clojure	clojure	CSS	css 
D	d	ditaa	ditaa 
Graphviz	dot	Emacs Calc	calc 
Emacs Lisp	emacs-lisp	Fortran	fortran 
gnuplot	gnuplot	Haskell	haskell 
Java	java	Javascript	js 
LaTeX	latex	Ledger	ledger 
Lisp	lisp	Lilypond	lilypond 
MATLAB	matlab	Mscgen	mscgen 
Objective Caml	ocaml	Octave	octave 
Org mode	org	Oz	oz 
Perl	perl	Plantuml	plantuml 
Processing.js	processing	Python	python 
R	R	Ruby	ruby 
Sass	sass	Scheme	scheme 
GNU Screen	screen	Sed	sed 
shell	sh	SQL	sql 
SQLite	sqlite
</pre>
<p>
上面的数据其实就是上一个模块中的表格的原始数据,在emacs中的org模式下先选中需要转换
的数据,然后可以通过下面的快捷键将一些数据很方便的转换为表格.
</p>
<pre class="example">
C-c | ( function: (org-table-create-or-convert-from-region ARG) )
</pre>

<p>
转换后的结果如下:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Language</td>
<td class="org-left">Identifier</td>
<td class="org-left">Language</td>
<td class="org-left">Identifier</td>
</tr>

<tr>
<td class="org-left">Asymptote</td>
<td class="org-left">asymptote</td>
<td class="org-left">Awk</td>
<td class="org-left">awk</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">C++</td>
<td class="org-left">C++</td>
</tr>

<tr>
<td class="org-left">Clojure</td>
<td class="org-left">clojure</td>
<td class="org-left">CSS</td>
<td class="org-left">css</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">d</td>
<td class="org-left">ditaa</td>
<td class="org-left">ditaa</td>
</tr>

<tr>
<td class="org-left">Graphviz</td>
<td class="org-left">dot</td>
<td class="org-left">Emacs Calc</td>
<td class="org-left">calc</td>
</tr>

<tr>
<td class="org-left">Emacs Lisp</td>
<td class="org-left">emacs-lisp</td>
<td class="org-left">Fortran</td>
<td class="org-left">fortran</td>
</tr>

<tr>
<td class="org-left">gnuplot</td>
<td class="org-left">gnuplot</td>
<td class="org-left">Haskell</td>
<td class="org-left">haskell</td>
</tr>

<tr>
<td class="org-left">Java</td>
<td class="org-left">java</td>
<td class="org-left">Javascript</td>
<td class="org-left">js</td>
</tr>

<tr>
<td class="org-left">LaTeX</td>
<td class="org-left">latex</td>
<td class="org-left">Ledger</td>
<td class="org-left">ledger</td>
</tr>

<tr>
<td class="org-left">Lisp</td>
<td class="org-left">lisp</td>
<td class="org-left">Lilypond</td>
<td class="org-left">lilypond</td>
</tr>

<tr>
<td class="org-left">MATLAB</td>
<td class="org-left">matlab</td>
<td class="org-left">Mscgen</td>
<td class="org-left">mscgen</td>
</tr>

<tr>
<td class="org-left">Objective Caml</td>
<td class="org-left">ocaml</td>
<td class="org-left">Octave</td>
<td class="org-left">octave</td>
</tr>

<tr>
<td class="org-left">Org mode</td>
<td class="org-left">org</td>
<td class="org-left">Oz</td>
<td class="org-left">oz</td>
</tr>

<tr>
<td class="org-left">Perl</td>
<td class="org-left">perl</td>
<td class="org-left">Plantuml</td>
<td class="org-left">plantuml</td>
</tr>

<tr>
<td class="org-left">Processing.js</td>
<td class="org-left">processing</td>
<td class="org-left">Python</td>
<td class="org-left">python</td>
</tr>

<tr>
<td class="org-left">R</td>
<td class="org-left">R</td>
<td class="org-left">Ruby</td>
<td class="org-left">ruby</td>
</tr>

<tr>
<td class="org-left">Sass</td>
<td class="org-left">sass</td>
<td class="org-left">Scheme</td>
<td class="org-left">scheme</td>
</tr>

<tr>
<td class="org-left">GNU Screen</td>
<td class="org-left">screen</td>
<td class="org-left">Sed</td>
<td class="org-left">sed</td>
</tr>

<tr>
<td class="org-left">shell</td>
<td class="org-left">sh</td>
<td class="org-left">SQL</td>
<td class="org-left">sql</td>
</tr>

<tr>
<td class="org-left">SQLite</td>
<td class="org-left">sqlite</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
